export class Func {

    constructor() {}

    static makeName(value) {
        const q = ["브딱이", "실딱이", "열정적인", "부끄러운", "예민보스", "충성스런", "신중한", "긴장한", "모태솔로", "유식한", "뱃살가득", "변비의", "똥쟁이", "방구쟁이", "이런말하긴모하지만얼굴이너무웃긴", "솔로", "치질걸린", "존잘탱", "맨발의", "유리멘탈", "답답한", "사랑꾼"];
        const w = ["맨홀뚜껑", "멸치", "변태", "개", "오랑우탄", "망나니", "트리캐라톱스", "코뿔소", "호나우딩요", "대머리", "귀요미", "크로마뇽인", "아조씨", "아줌씨", "할배", "똥덩어리", "똥", "도롱뇽", "지나가던행인A", "불방망이", "난봉꾼", "바람둥이", "여왕벌", "카사노바", "방구쟁이"];
        
        return q[value.charCodeAt(0) % q.length] + ' ' + w[value.charCodeAt(1) % w.length];
    }
}