export class Func {
    arr = {
        "과일": ["체리","자두","딸기","오렌지","사과","키위","메론","포도","복숭아","레몬","수박","망고","자몽","살구","리치","거봉","유자","매실","코코넛","바나나","석류","망고스틴","두리안","산딸기","아보카도","구아바","무화과","블루베리","파인애플","한라봉"],
        //"분식": [, "허파"],
        //"라면": [],
        "동물": ["고양이", "강아지", "거북이", "토끼", "뱀", "사자", "호랑이", "표범", "치타", "하이에나", "기린", "코끼리", "코뿔소", "하마", "악어", "펭귄", "부엉이", "올빼미", "곰", "돼지", "소", "닭", "독수리", "타조", "고릴라", "오랑우탄", "침팬지", "원숭이", "코알라", "캥거루","말티즈", "포메라니안", "진돗개", "치와와", "시베리안 허스키", "시바견", "리트리버", "똥개", "닥스훈트"],
        "음식": ["엽떡", "초코크림빵", "묵은지김밥", "간장게장", "족발", "수육", "명란구이", "잔치국수", "탕수육", "물냉면", "비빔냉면", "쭈꾸미삼겹", "치즈등갈비", "육회비빔밥", "벌집삼겹살", "버블티", "차돌된장찌개", "짜장면", "월남쌈", "짬뽕", "잡탕밥", "돼지갈비", "LA갈비", "유부초밥", "소갈비", "참치김치찌개", "호박떡", "육개장", "팔보채", "평양냉면", "알밥", "대패삼겹살", "파김치에짜파게티", "꽈배기도넛", "꽃삼겹살", "초밥", "회오리감자", "호미빙", "오징어버터구이", "연탄불고기", "오레오빙수", "연두부", "회덮밥", "깐풍기", "미역국", "물회", "콩나물국밥", "오징어회", "참치회", "고등어구이", "명란젓", "실비김치", "고사리", "크림카레우동", "갈비찜", "치맥", "돈까스", "볶음김치", "계란말이", "숯불닭갈비", "소고기무국", "곰탕", "갈비탕", "호박전", "치즈감자고로케", "쫄병스낵", "케밥", "골뱅이무침", "깍두기", "비빔국수", "꽃빵", "참치비빔밥", "불고기버거", "겉절이", "수제비", "파전", "명이나물", "피자찐빵", "오돌뼈", "양념게장", "팟타이", "떡볶이", "뼈해장국", "가리비구이", "비지찌개", "무지개떡", "간장새우", "김밥", "녹차모찌", "생새우초밥", "남산왕돈까스", "모닥치기", "조랭이떡", "녹치케", "골뱅이소면무침", "김치만두", "군만두", "물만두", "찐빵", "멸치볶음", "쫄면", "순대", "곱창", "대창", "막창", "콩나물무침", "모찌롤", "냉치킨", "선지해장국", "깐쇼새우", "유산슬", "고구마빵", "돼지국밥", "횡성한우", "파김치", "새우죽", "고추장찌개", "통감자", "엽떡", "회냉면", "낙지젓", "육포", "고구마밥", "생선까스", "오이지", "된장국", "찹쌀도넛", "백김치", "파래", "안동찜닭", "까르보나라떡볶이", "설렁탕", "석박지", "어묵꼬치", "열무비빔밥", "광어회", "고추잡채", "닭도리탕", "참치볶음", "슈크림빵", "오징어무침", "양념갈비", "닭똥집", "식혜", "한우스테이크", "돌솥비빔밥", "성게알", "야쿠르트", "조기구이", "돼지갈비찜", "명란스파게티", "후쿠오카함바그", "파무침", "미숫가루", "총각김치", "쌈장", "떡갈비", "양꼬치", "홍초", "굴", "짬뽕밥", "말린과일", "볶음우동", "닭강정", "된장국", "동치미", "떡꼬치", "김말이튀김", "두부", "냉이된장국", "치즈돈까스정식", "쟁반짜장", "연어알", "삼계탕", "카레우동", "찹쌀도넛", "관자", "호로요이", "순두부찌개", "이삭토스트", "국물닭발", "해물순두부", "오설록", "군밤", "붕어빵", "규동", "편육", "쌀국수", "볶음밥", "김치전", "소갈비찜", "동그랑땡", "유자차", "송편", "우삼겹", "쟁반짜장", "전병", "뼈해장국", "스테키동", "텐텐", "바나나맛우유", "새우젓", "감자떡", "맥심골드", "주먹김밥", "갈치조림", "안성국밥", "호박나물", "짜장밥", "고구마", "마파두부", "감자탕", "육사시미", "곱창전골", "불고기", "숙주나물", "호떡", "참치김밥", "타코야끼", "참치뱃살", "떡국", "김치전", "춘장에양파", "약과", "호박찌개", "알탕", "잡채", "카레라이스", "마크정식", "명란삼각김밥", "녹차라떼", "꽃등심", "함박스테이크", "소금구이", "잡채밥", "묵은지", "토마토리조또", "초고추장", "복숭아", "맥반석오징어", "라면", "파닭", "찹쌀떡", "로이스초콜릿", "어포", "홍합", "양구이", "백설기", "단호박죽", "오감자칠리", "장조림", "청국장", "우동", "김칫국", "횡성한우", "야채곱창", "몽쉘", "오예스", "꼬막", "돼지껍데기", "빈대떡", "샤브샤브", "오리훈제구이", "아침햇살", "아구찜", "전복", "항정살", "닭발", "산낙지", "생간", "뻥튀기", "찰보리밥", "고구마스틱", "삼각커피우유", "메리딸기", "메리초코", "카스타드", "육회", "라볶이", "제육볶음", "취나물", "꼬꼬면", "오이냉국", "삼각커피우유", "짜글이", "소고기야채죽", "닭갈비", "쭈꾸미", "꼬마김밥", "짬뽕밥", "찹쌀탕수육", "카레", "양대창", "짜장밥", "파리바게트순수우유케이크", "가츠동", "밥버거", "갓김치", "틈새라면", "닭발", "계란찜", "매운탕", "홍어무침", "꿔바로우", "허니버터칩", "곶감", "표고버섯", "오이김치", "셀렉션초코맛", "두유", "주먹밥", "날치알", "고르곤졸라", "꽃게랑", "고기만두", "감자수제비", "왕만두", "참치마요", "고기육수", "규카츠", "라멘", "낙지호롱구이", "떡만두국", "초코퍼지아이스크림", "소갈비찜", "기름떡볶이", "염통", "메로나", "엽떡", "가리비구이", "불초밥", "당면", "스파클링와인", "부대찌개", "부추김치", "천엽", "간짜장", "꽃게탕", "홍합탕", "두유", "팥빙수", "고구마피자", "아구탕", "내장볶음", "두부김치", "비름나물", "조개구이", "목살스테이크", "버섯전골", "간장치킨", "스프링롤", "북어탕", "치즈곱창", "팽이버섯", "쭈꾸미", "인절미", "쌈무", "민물장어", "간", "뚝배기불고기", "인절미빙수", "돈까스김밥", "시래기국", "찐옥수수", "민트초코우유", "검은콩우유", "뽀글이", "황태해장국", "동태전", "설빙", "탕평채", "무지개케익", "소고기덮밥", "등갈비", "포카리스웨트", "보쌈", "짜장라면", "쌀통닭", "해파리냉채", "돼지김치찌개", "김치부침개", "콩국수", "동지팥죽", "철판볶음밥", "춘천닭갈비", "가츠나베", "깍두기밥", "홍시", "냉짬뽕", "냉우동", "더덕회무침", "바지락칼국수", "오꼬노미야끼", "단호박식혜", "녹차아이스크림", "꽃게찜", "감자전", "아바이순대", "매실주스", "목살", "호떡", "구운김", "오뜨", "조개관자구이", "매운새우깡", "간짬뽕", "피카츄돈까스", "닭꼬치", "명량핫도그", "수육", "내장탕", "흑돼지", "순댓국", "해물삼합", "녹차빙수", "불닭볶음면", "오므라이스", "오징어튀김", "왕교자", "죠리퐁", "김치찜", "어묵탕", "고구마피자", "피자빵", "매운새우깡", "멘보샤", "갈릭디핑소스", "곤약", "소머리국밥", "전복죽", "꼬치구이", "기름떡볶이", "누룽지탕", "후라이드치킨", "닭꼬치", "커스터드생크림빵", "깻잎", "해물전골", "곤약", "마늘장아찌", "김구이", "양송이버섯", "마끼", "흰쌀밥", "버섯칼국수", "들깨수제비", "하이라이스", "델리만쥬", "전주비빔밥", "크림레몬새우", "기름장", "낙지볶음밥", "불족발", "초코모찌", "주먹밥", "가지나물", "꿀고구마", "양대창", "가래떡", "성게알", "막국수", "유부초밥", "계란국", "굴국밥", "해물탕", "맛밤", "컵밥", "야끼우동", "뼈해장국", "소고기국밥", "깡통도시락", "사골우거지국", "코다리냉면", "갈치구이", "오이소박이", "다슬기국", "도미회", "대게살", "새우구이", "메로구이", "고기국수", "냉모밀", "야끼소바", "삼계탕", "닭죽", "길거리토스트", "돼지주물럭", "나시고랭", "딤섬", "방어회", "꿀꽈배기", "계란과자", "새싹비빔밥", "따끈한밥에스팸한조각", "새우튀김", "버거킹와퍼", "삼각김밥", "청경채", "차슈", "한솥도시락", "김치가츠나베우동", "된장국", "삼선볶음밥", "모닝빵", "조개구이", "호두과자", "순대국", "무말랭이", "나가사끼짬뽕", "오모리김치찌개", "돈코츠라멘", "검은콩두유"],
        //"꽃": ["장미", "튤립", "해바라기", "민들레", "국화"],
        "자동차": ["케딜락", "포드", "쉐보레", "지프", "링컨", "테슬라", "포르쉐", "아우디", "폭스바겐", "벤츠", "마이바흐", "현대", "기아", "제네시스", "대우", "쌍용", "르노삼성", "닛산", "렉서스", "도요타", "혼다", "인피니티", "람보르기니", "페라리", "마세라티", "재규어"],
        "나라": ["스페인", "중국", "일본", "이탈리아", "태국", "스위스", "노르웨이", "미국", "핀란드", "캐나다", "벨기에", "독일", "이스라엘", "프랑스", "영국", "덴마크", "스웨덴", "이탈리아", "헝가리", "우루과이", "칠레", "코스타리카", "러시아", "조지아", "요르단", "베트남", "이집트", "세네갈", "마다가스카르", "가나", "인도", "키르기스스탄", "라이베리아"],
        //"명품": ["루이비통", "샤넬", "구찌", "입생로랑", "발렌티노"],
        //"아이스크림": ["바밤바", "붕어싸만코", "뽕따", "월드콘", "구구콘", "메로나", "하겐다즈", "베스킨라빈스", "빵또아"],
        "가수": ["소녀시대", "엑소", "우주소녀", "레드벨벳", "비투비", "방탄소년단", "아이유", "오마이걸", "브레이브걸스", "임영웅", "여자친구", "성시경", "화사", "제니", "정은지", "이석훈", "양요섭", "선미", "벤", "걸스데이", "송가인", "블랙핑크", "헤이즈", "트와이스", "샤이니"],
        //"국내지역": ["부산", "서울", "전주", "대구", "울산", "광주", "대전", "경기", "충남", "충북", "천안"],
        //"캐릭터": ["뽀로로", "피카츄", "어피치", "도라에몽", "헬로키티", "보노보노", "짱구", "루피", "조로", "나미", "상디", "아기상어", "뿡뿡이"],
        //"돼지": [],
        //"전자제품": ["컴퓨터", "노트북", "닌텐도", "태블릿", "휴대폰", "버즈", "에어팟"],
        //"색깔": ["분홍색", "노란색", "파란색", "검은색", "흰색", "보라색", "주황색", "빨간색", "초록색", "남색"],
        //"학교": ["책상", "의자", "칠판", "분필", "교탁", "학생", "교복", "땡땡이", "야자", "매점", "수강신청"],
        //"직급": ["사원", "대리", "과장", "팀장", "사장", "이사", "대표", "상무", "차장"],
        //"발효식품": ["고추장", "막걸리", "된장", "김치", "젓갈"],
        //"강아지": ["말티즈", "포메라니안", "진돗개", "치와와", "시베리안 허스키", "시바견", "리트리버", "똥개", "닥스훈트"],
        "브랜드": ["나이키", "뉴발란스", "컨버스", "아식스", "아디다스", "루이비통", "샤넬", "구찌", "입생로랑", "발렌티노"],
        //"서울지역": ["동대문", "명동", "강남", "홍대", "이태원", "신촌", "홍제", "서대문", "남대문", "독립문", "흥인지문", "광화문"],
        //"욕실": ["샴푸", "슬리퍼", "거울", "칫솔", "샤워기", "똥", "변기", "욕조", "수건", "린스", "트리트먼트"],
        //"주방": ["냉장고", "국자", "젓가락", "냄비","숟가락","쿠킹 호일", "전자렌지", "가스렌지", "수세미", "그릇", "후라이팬"],
        "한국영화": ["명량", "극한직업", "신과함께", "국제시장", "베테랑", "괴물", "도둑들", "칠번방의 선물", "암살", "광해", "왕의 남자", "태극기 휘날리며", "부산행", "변호인", "실미도", "기생충", "검사 외전", "엑시트", "설국열차", "내부자들", "수상한 그녀", "국가대표", "과속스캔들", "히말라야", "써니", "베를린", "터널", "인천상륙작전", "완득이", "더킹", "인간중독", "끝까지 간다", "군도", "신의한수", "타짜", "기술자들", "빅매치", "스물", "부당거래", "김복남 살인사건의 전말", "아가씨", "피에타", "곡성", "범죄와의 전쟁", "악마를 보았다", "아저씨", "건축학개론", "쉬리", "밀양", "용서받지 못한 자", "친구", "태극기 휘날리며", "복수는 나의 것", "고지전", "장화 홍련", "공공의 적", "달콤한 인생", "하녀", "똥파리", "한공주", "친절한 금자씨", "라디오스타", "식객", "여고괴담", "범죄의 재구성", "주유소 습격사건", "미녀는 괴로워", "라스트 갓파더", "오싹한 연애", "화차", "내 아내의 모든 것", "후궁", "이웃사람", "늑대소년", "박수건달", "베를린", "신세계", "숨바꼭질", "화이", "쎄시봉", "살인의뢰", "암살", "검은 사제들", "의형제", "방자전", "이끼", "해결사", "초능력자", "황해", "쌍화점", "워낭소리", "박쥐", "마더", "거북이 달린다", "해운대", "내 사랑 내 곁에", "굳모닝 프레지던트", "원스 어폰 어 타임", "추격자", "좋은 놈 나쁜 놈 이상한 놈", "신기전", "아내가 결혼했다", "그놈 목소리", "바람피기 좋은날", "우아한 세계", "검은 집", "디 워", "투사부일체", "사생결단", "한반도", "가문의 부활", "해바라기", "몽정기", "말아톤", "마파도", "잠복근무", "주먹이 운다", "남극일기", "웰컴 투 동막골", "너는 내운명", "광식이 동생 광태", "실미도", "말죽거리 잔혹사", "동갑내기 과외하기", "내 여자친구를 소개합니다", "엽기적인 그녀", "늑대의 유혹", "바람의 파이터", "귀신이 산다"],
        "외국영화": ["아바타", "어벤져스", "타이타닉", "스타워즈", "쥬라기 월드", "분노의 질주", "겨울 왕국", "블랙 팬서", "해리포터", "미녀와 야수", "토이 스토리", "인크레더블", "아이언맨", "미니언즈", "캡틴 아메리카", "아쿠아맨", "트랜스포머", "캡틴 마블", "반지의 제왕", "다크 나이트 라이즈", "캐리비안의 해적", "슈퍼배드", "이상한 나라의 엘리스", "호빗", "주토피아", "라이온 킹", "정글 북", "쥬만지", "니모를 찾아서", "트와일라잇", "헝거 게임", "슈퍼맨", "아이스 에이지", "슈렉", "엑스맨", "스파이더맨", "데드풀", "조커", "행오버", "다이하드", "인디아나 존스", "미이라", "록키", "알라딘", "신데렐라", "인사이드 아웃", "엑소시스트", "그것"],
        "명대사": ["내가 왕이 될 상인가", "호의가 계속되면 그게 권리인 줄 알아요", "내가 큰 실수를 할 뻔했어", "금이빨 빼고 모조리 씹어먹어줄게", "이거 방탄유리야", "아직 한 발 남았다", "드루와 드루와", "거 죽기 딱 좋은 날씨네", "살려는 드릴게", "장난이 너무 심한거 아니오", "국가란 국민입니다", "나 이대나온 여자야", "아수라발발타", "싸늘하다", "가슴에 비수가 날아와 꽂힌다", "동작그만 밑장빼기냐", "난 딴 돈의 반만 가져가", "어이가 없네", "나 여기 아트박스 사장인데", "어차피 대중들은 개 돼지들입니다", "밥은 먹고 다니냐", "비겁한 변명입니다", "날 쏘고가라", "내가 니 시다바리가", "니가 가라 하와이", "느그 아부지 머하시노", "너나 잘하세요", "묻고 더블로 가", "예림이 그 패 봐봐 혹시 장이야", "살아있네", "알 유 냄궁민수", "나다 이 씹새끼야", "병준이형 형은 나가", "넌 내게 모욕감을 줬어", "그런데 말입니다", "너는 이미 죽어있다", "너때문에 흥이 다 깨져버렸으니까 책임져", "내가 고자라니", "내 목숨을 아이어에", "니들이 게맛을 알아", "등짝을 보자", "라면 먹고 갈래", "망했어요", "모르는데 어떻게 가요", "아뇨 뚱인데요", "왼손은 거들 뿐", "이게 아부지도 없는게 까불어", "입 닥쳐 말포이", "페이크다 이 병신들아", "풍악을 울려라", "사딸라"],
        "캐릭터": ["가렌", "갈리오", "갱플랭크", "그라가스", "그레이브즈", "그웬", "나르", "나미", "나서스", "노틸러스", "녹턴", "누누와윌럼프", "니달리", "다리우스", "다이애나", "드레이븐", "라이즈", "라칸", "람머스", "럭스", "럼블", "레넥톤", "레오나", "렉사이", "렝가", "루시안", "룰루", "르블랑", "리신", "리븐", "리산드라", "마스터이", "마오카이", "말자하", "말파이트", "모데카이저", "모르가나", "문도박사", "미스포츈", "바드", "바루스", "바이", "베이가", "베인", "벨코즈", "볼리베어", "브라움", "브랜드", "블라디미르", "블리츠크랭크", "빅토르", "비에고", "뽀삐", "사이온", "사일러스", "샤코", "세나", "세주아니", "세트", "소나", "소라카", "쉔", "쉬바나", "스웨인", "스카너", "시비르", "신짜오", "신드라", "신지드", "쓰레쉬", "아리", "아무무", "아우렐리온솔", "아이번", "아지르", "아칼리", "아트록스", "아펠리오스", "알리스타", "애니", "애니비아", "애쉬", "야스오", "에코", "엘리스", "오공", "오른", "오리아나", "올라프", "요릭", "우디르", "우르곳", "워윅", "유미", "이렐리아", "이블린", "이즈리얼", "일라오이", "자르반4세", "자야", "자이라", "자크", "잔나", "잭스", "제드", "제라스", "제이스", "조이", "직스", "진", "질리언", "징크스", "초가스", "카르마", "카밀", "카사딘", "카서스", "카시오페아", "카이사", "카직스", "카타리나", "칼리스타", "케넨", "케이틀린", "케인", "케일", "코그모", "코르키", "퀸", "클레드", "키아나", "킨드레드", "타릭", "탈론", "탈리야", "탐켄치", "트런들", "트리스타나", "트린다미어", "트위스티드페이트", "트위치", "티모", "파이크", "판테온", "피들스틱", "피오라", "피즈", "하이머딩거", "헤카림"]
    };
    constructor() { }

    static makeName(value) {
        const q = ["브딱이", "실딱이", "열정적인", "부끄러운", "예민보스", "충성스런", "신중한", "긴장한", "모태솔로", "유식한", "뱃살가득", "변비의", "똥쟁이", "방구쟁이", "이런말하긴모하지만얼굴이너무웃긴", "솔로", "치질걸린", "존잘탱", "맨발의", "유리멘탈", "답답한", "사랑꾼"];
        const w = ["맨홀뚜껑", "멸치", "변태", "개", "오랑우탄", "망나니", "트리캐라톱스", "코뿔소", "호나우딩요", "대머리", "귀요미", "크로마뇽인", "아조씨", "아줌씨", "할배", "똥덩어리", "똥", "도롱뇽", "지나가던행인A", "불방망이", "난봉꾼", "바람둥이", "여왕벌", "카사노바", "방구쟁이"];

        return q[value.charCodeAt(0) % q.length] + ' ' + w[value.charCodeAt(1) % w.length];
    }

    static split_hangul(kor, idx) {
        const f = ['ㄱ', 'ㄲ', 'ㄴ', 'ㄷ', 'ㄸ', 'ㄹ', 'ㅁ',
            'ㅂ', 'ㅃ', 'ㅅ', 'ㅆ', 'ㅇ', 'ㅈ', 'ㅉ',
            'ㅊ', 'ㅋ', 'ㅌ', 'ㅍ', 'ㅎ'];
        const s = ['ㅏ', 'ㅐ', 'ㅑ', 'ㅒ', 'ㅓ', 'ㅔ', 'ㅕ',
            'ㅖ', 'ㅗ', 'ㅘ', 'ㅙ', 'ㅚ', 'ㅛ', 'ㅜ',
            'ㅝ', 'ㅞ', 'ㅟ', 'ㅠ', 'ㅡ', 'ㅢ', 'ㅣ'];
        const t = ['', 'ㄱ', 'ㄲ', 'ㄳ', 'ㄴ', 'ㄵ', 'ㄶ',
            'ㄷ', 'ㄹ', 'ㄺ', 'ㄻ', 'ㄼ', 'ㄽ', 'ㄾ',
            'ㄿ', 'ㅀ', 'ㅁ', 'ㅂ', 'ㅄ', 'ㅅ', 'ㅆ',
            'ㅇ', 'ㅈ', 'ㅊ', 'ㅋ', 'ㅌ', 'ㅍ', 'ㅎ'];

        const ga = 44032;
        let result = '';

        for (var i = 0; i < kor.length; i++) {

            let uni = kor[i].charCodeAt(0);
            uni = uni - ga;
            let fn = Math.floor(uni / 588);            
            let sn = Math.floor((uni - (fn * 588)) / 28);

            if (idx == 0) {

                if (f[fn] == undefined)
                    result += ' ';
                else
                    result += f[fn];
            }
            else if (idx == 1) {

                if (s[sn] == undefined)
                    result += ' ';
                else
                    result += s[sn];
            }
            // let tn = parseInt(uni % 28);
        }
        return result;
    }
}
